#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.api_gateway.aws_api_gateway_authorizer.cognito_authorizer will be created
  + resource "aws_api_gateway_authorizer" "cognito_authorizer" {
      + arn                              = (known after apply)
      + authorizer_result_ttl_in_seconds = 300
      + id                               = (known after apply)
      + identity_source                  = "method.request.header.Authorization"
      + name                             = "fiap-lumiere-cognito-authorizer"
      + provider_arns                    = (known after apply)
      + rest_api_id                      = (known after apply)
      + type                             = "COGNITO_USER_POOLS"
    }

  # module.api_gateway.aws_api_gateway_deployment.api_gateway_deploy will be created
  + resource "aws_api_gateway_deployment" "api_gateway_deploy" {
      + created_date  = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_integration.file_operation will be created
  + resource "aws_api_gateway_integration" "file_operation" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP"
      + uri                     = "https://media-storage-lb-1234567890.us-east-1.elb.amazonaws.com/storage/{operation}"
    }

  # module.api_gateway.aws_api_gateway_integration.user_records will be created
  + resource "aws_api_gateway_integration" "user_records" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "HTTP"
      + uri                     = "https://media-storage-lb-1234567890.us-east-1.elb.amazonaws.com/records/user-records"
    }

  # module.api_gateway.aws_api_gateway_method.file_operation will be created
  + resource "aws_api_gateway_method" "file_operation" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.path.operation" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_method.user_records will be created
  + resource "aws_api_gateway_method" "user_records" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.querystring.statuses" = false
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.file_operation will be created
  + resource "aws_api_gateway_resource" "file_operation" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{operation}"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.records will be created
  + resource "aws_api_gateway_resource" "records" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "records"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.storage will be created
  + resource "aws_api_gateway_resource" "storage" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "storage"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_resource.user_records will be created
  + resource "aws_api_gateway_resource" "user_records" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "user-records"
      + rest_api_id = (known after apply)
    }

  # module.api_gateway.aws_api_gateway_rest_api.api_gateway will be created
  + resource "aws_api_gateway_rest_api" "api_gateway" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API for project records"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "fiap-lumiere-api-gateway"
      + policy                       = (known after apply)
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration (known after apply)
    }

  # module.api_gateway.aws_api_gateway_stage.api_gateway_stage_dev will be created
  + resource "aws_api_gateway_stage" "api_gateway_stage_dev" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

  # module.cognito_pools.aws_cognito_user_pool.user_pool will be created
  + resource "aws_cognito_user_pool" "user_pool" {
      + arn                        = (known after apply)
      + auto_verified_attributes   = [
          + "email",
        ]
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "fiap-lumiere-user-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)
      + user_pool_tier             = (known after apply)
      + username_attributes        = [
          + "email",
        ]

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config (known after apply)

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = false
          + require_uppercase                = false
          + temporary_password_validity_days = (known after apply)
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + username_configuration (known after apply)

      + verification_message_template {
          + default_email_option  = "CONFIRM_WITH_CODE"
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.cognito_pools.aws_cognito_user_pool_client.user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "user_pool_client" {
      + access_token_validity                         = (known after apply)
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = (known after apply)
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + generate_secret                               = false
      + id                                            = (known after apply)
      + id_token_validity                             = (known after apply)
      + logout_urls                                   = (known after apply)
      + name                                          = "fiap-lumiere-user-pool-client"
      + prevent_user_existence_errors                 = "ENABLED"
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = (known after apply)
      + supported_identity_providers                  = [
          + "COGNITO",
        ]
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)
    }

  # module.dynamo_db.aws_dynamodb_table.main will be created
  + resource "aws_dynamodb_table" "main" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "id"
      + id               = (known after apply)
      + name             = "fiap-lumiere-table"
      + range_key        = "user_id"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fiap-lumiere-table"
        }
      + tags_all         = {
          + "Environment" = "Dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "fiap-lumiere-table"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "id"
          + type = "S"
        }
      + attribute {
          + name = "user_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = false
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl (known after apply)
    }

  # module.ecs_instances.aws_ecs_service.api will be updated in-place
  ~ resource "aws_ecs_service" "api" {
      ~ desired_count                      = 1 -> 0
        id                                 = "arn:aws:ecs:us-east-1:904106077871:service/fiap-lumiere-cluster/fiap-lumiere-api-service"
        name                               = "fiap-lumiere-api-service"
        tags                               = {}
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs_instances.aws_ecs_task_definition.api will be updated in-place
  ~ resource "aws_ecs_task_definition" "api" {
        id                       = "fiap-lumiere-api-task"
      ~ tags                     = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "fiap-lumiere-api-task"
        }
      ~ tags_all                 = {
          + "ManagedBy" = "Terraform"
          + "Name"      = "fiap-lumiere-api-task"
        }
        # (16 unchanged attributes hidden)
    }

  # module.s3_buckets.aws_s3_bucket.media_storage will be created
  + resource "aws_s3_bucket" "media_storage" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "fiap-lumiere-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "Media storage Bucket"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "Media storage Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.s3_buckets.aws_s3_bucket_cors_configuration.media_storage_cors_config will be created
  + resource "aws_s3_bucket_cors_configuration" "media_storage_cors_config" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.s3_buckets.aws_s3_bucket_lifecycle_configuration.media_storage_lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "media_storage_lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 7
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "sources/"
            }
        }
    }

  # module.s3_buckets.aws_s3_bucket_notification.media_storage_sources_event will be created
  + resource "aws_s3_bucket_notification" "media_storage_sources_event" {
      + bucket      = (known after apply)
      + eventbridge = false
      + id          = (known after apply)

      + queue {
          + events        = [
              + "s3:ObjectCreated:Put",
            ]
          + filter_prefix = "sources/*"
          + id            = (known after apply)
          + queue_arn     = "arn:aws:sqs:us-east-1:904106077871:fiap-lumiere-source-files-events-queue"
        }
    }

  # module.s3_buckets.aws_s3_bucket_public_access_block.media_storage_restrictions will be created
  + resource "aws_s3_bucket_public_access_block" "media_storage_restrictions" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # module.sqs_queues.data.aws_iam_policy_document.result_files_events_queue_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "result_files_events_queue_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + "arn:aws:lambda:us-east-1:904106077871:function:FiapLumiereMediaProcessorLambda",
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "904106077871",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.sqs_queues.data.aws_iam_policy_document.source_files_events_queue_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "source_files_events_queue_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sqs:SendMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:sqs:us-east-1:904106077871:fiap-lumiere-source-files-events-queue",
            ]

          + condition {
              + test     = "ArnLike"
              + values   = [
                  + (known after apply),
                ]
              + variable = "aws:SourceArn"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "904106077871",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "s3.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.sqs_queues.aws_sqs_queue.result_files_events_queue will be created
  + resource "aws_sqs_queue" "result_files_events_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 345600
      + name                              = "fiap-lumiere-result-files-events-queue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + sqs_managed_sse_enabled           = (known after apply)
      + tags_all                          = (known after apply)
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.sqs_queues.aws_sqs_queue_policy.result_files_events_queue_policy will be created
  + resource "aws_sqs_queue_policy" "result_files_events_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = (known after apply)
    }

  # module.sqs_queues.aws_sqs_queue_policy.source_queue_policy will be created
  + resource "aws_sqs_queue_policy" "source_queue_policy" {
      + id        = (known after apply)
      + policy    = (known after apply)
      + queue_url = "https://sqs.us-east-1.amazonaws.com/904106077871/fiap-lumiere-source-files-events-queue"
    }

Plan: 23 to add, 2 to change, 0 to destroy.
```

</details>

*Pushed by: @WesleySangalli, Action: `pull_request`*